tutorials/fluids/dbnsDyMFluid/HronTurek/HronTurekFsi3_CFD/system/functions
functions
{

   forces
   {
       type                forces;
       functionObjectLibs  ( "libforces.so" );
       outputControl       timeStep;
       outputInterval      1;
       patches             (plate);
       "pName|p"           p;
       "UName|U"           U;
       "rhoName|rho"       rho;
       log                 true;
       rhoInf              1000;
       CofR                (0.5 0.1 0);
   }
}